domains/mirror/pe/ofTemplates/LES_COMPRESSIBLE/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.15 -0.223  0.52)
    ( 0.25 -0.223  0.52)
    ( 0.25  0.102  0.52)
    (-0.15  0.102  0.52)
    (-0.15 -0.223  0.82)
    ( 0.25 -0.223  0.82)
    ( 0.25  0.102  0.82)
    (-0.15  0.102  0.82)
);

// 0.4 0.3 0.3

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 3 3)
    simpleGrading (1 1 1)
); 

edges
( 
);

boundary
(
    left
    {
        type patch;
        faces
        (
         (0 4 7 3)
        );
    }

    right
    {
        type patch;
        faces
        (
         (2 6 5 1)
        );
    }

    back
    {
        type wall;
        faces
        (
          (3 7 6 2)
        );
    }
    
    front
    {
        type patch;
        faces
        (
          (1 5 4 0)
        );
    }
    
    bottom
    {
        type patch;
        faces
        (
          (0 3 2 1)
        );
    }

    top
    {
        type patch;
        faces
        (
          (4 5 6 7)
        );
    }
);

// ************************************************************************* //
