domains/mirror/pe/ofTemplates/LES_COMPRESSIBLE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          9;
        startFace       75;
    }
    right
    {
        type            patch;
        nFaces          9;
        startFace       84;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          12;
        startFace       93;
    }
    front
    {
        type            patch;
        nFaces          12;
        startFace       105;
    }
    bottom
    {
        type            patch;
        nFaces          12;
        startFace       117;
    }
    top
    {
        type            patch;
        nFaces          12;
        startFace       129;
    }
)

// ************************************************************************* //
