domains/mirror/pe/ofTemplates/LES_COMPRESSIBLE/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{

  "(left|right|bottom|top|front).*"
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    "proc.*"
    {
        type            processor;
    }


     back
      {
      type            zeroGradient;
      } 

   carGroup 
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
