domains/mirror/pe/ofTemplates/LES_COMPRESSIBLE/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(left|right|bottom|top|front).*"
    {
        type      	  calculated;
        value		  uniform 0;	
    }


    back // WALL
    {
       type            compressible::alphatWallFunction;
       value           uniform 0;
    }

	"proc.*"
    {
        type            processor;
    }

    carGroup // WALL
    {
       type            compressible::alphatWallFunction;
       value           uniform 0;
    }

}

