domains/mirror/pe/ofTemplates/LES_COMPRESSIBLE/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.54; 	

// turbulence intensity: I = u'/U. At weak/medium turbulence usuall u' = 0.01U, so in our case we can take 
// approximately: I= 0.01, or 1% of the mean flow. Then from the formula of k, we can have 
// k = 1.5*(I*U)^2 = 1.5*(0.27)^2=0.10935
// now 0.6 --> =0.54

boundaryField
{
    "(left|right|bottom|top|front).*"
    {
        type            fixedValue;
        value		uniform 0.54;
    }

    "proc.*"
    {
        type            processor;
    }

    back
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    carGroup 
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

}
